{"projects": [
    {
    "title": "Music Calendar",
    "id" : "6",
    "summary" : "A web app that reminds users of album birthdays.",
    "description": "This app notifies the user with an email when it is the anniversary of an album in their collection. Notification includes the age, a summary of the album and the album art",
    "url" : "/MusicCalendar",
    "picture": "album-anniversary",
    "challenges" : "",
    "languages" : "HTML/CSS, Javascript, Python, React",
    "code" : "https://github.com/Matthew-Simanonis/horse-bets",
    "improvements" : ""
    },
   {
    "title": "Horse-Bets",
    "id" : "0",
    "summary" : "A single page Web App, used for getting racing horse odds.",
    "description": "A simple betting application made for my father. The user selects the horses recent placements and the app calculates the top horses",
    "url" : "/horse-bets",
    "picture": "horse-bets",
    "challenges" : "I wanted to make everything run without needing to reload the page. This led me to writing my first app with JavaScript. While syntax was never an issue, getting a grip on the JavaScript/HTML interaction was tough. In order to create many horses, I wrote a loop in javascript to create the appropriate HTML code. This allowed me to create a self made horse component to copy, as the UI for each horse was gonna be the same",
    "languages" : "HTML/CSS, Javascript, Python",
    "code" : "https://github.com/Matthew-Simanonis/horse-bets",
    "improvements" : "I think this page could use a design update. It was one of my first webpages and it is pretty clunky. Making this with React would make my life alot easier so I may re-create the app from scratch."
   },
   {
    "title": "Album Anniversary",
    "id": "1",
    "summary" : "An email reminder system for Album Birthdays",
    "description": "This app notifies the user with an email when it is the anniversary of an album in their collection. Notification includes the age, a summary of the album and the album art.",
    "url" : "",
    "picture": "album-anniversary",
    "challenges" : "This was my first real program. So naturally everything was a challenge. A big one was how to find album anniversaries in a common format and the possibility of albums with the same name. Though not the beste solution I used BeautifulSoup 4, a Python library that can scrape HTML. I scraped wikipedia for dates and saved them to a CSV. Unfortunately Wikipedia uses different URL formats for albums, so the program had to test for different formats. Sometime with the artist name, sometimes with \"(album)\" at the end. Using 5 queries I was able to accurately grab release dates for the requested albums. When I returned to this app a few months later, I wanted to add the Album Cover art to the notification. Here I used the Wikipedia API to grab a summary of the album, and the image url, which then could be saved and sent via email.",
    "languages" : "Python",
    "code" : "https://github.com/Matthew-Simanonis/AlbumAnniversaryApp",
    "improvements" : "I want to create a website with this feature, along with personalized album lists for users. Storing all the album info would be a doozy, and something I would have to find a creative solution for"
   },
   {
    "title": "MACD-Alerts",
    "id": "2",
    "summary" : "A stock monitoring app that notifies user of buy/sell signal in a set of stocks",
    "description": "An app that scans a users stock portfolio for a Stochastic/MACD double crossover and emails the user with a relative buy or sell signal.",
    "url" : "",
    "picture": "ethchart",
    "challenges" : "A lot of the challenge for this program came in getting the circles on the graph in the right spot. I needed to keep track of the Y value on the graph, my solution was to manually save the value in a tuple so that each value could be graphed. I'm sure there is a cleaner way to to do this, but it worked at the time. Now I just need a better system to plug in, that actually makes money.",
    "languages" : "Python",
    "code" : "https://github.com/Matthew-Simanonis/MacdSignal",
    "improvements" : "I would like to create a website that dynamically allows you to use this app. Possibly allow users to create an account that saves your watchlist and email for a personalized experience. As well using different indicators at different threshholds"
   },
   {
    "title": "Portfolio",
    "id": "3",
    "summary" : "My own website. I made it with Flask and React.js, it is currently hosted on AWS",
    "description": "A website to display my experience and skills. Contains my portfolio and information about me, Matthew Simanonis. It uses Flask as a back-end and React.js as the frontend. There is not much going on in the back-end as this was created mostly to practice my front end skills.",
    "url" : "",
    "picture": "portfolio",
    "challenges" : "It was defintetly a challenged to try and make my site look pretty, functional and do something that would stand out. I also wanted to create my own carousel, so making that was a learning experience. To create my carousel of projects I wanted to avoid using an existing library, as I enjoy the customizability of something you create yourself, and many of these libraries didnt allow for drag scrolling. I solved this with a clever use of overflow scrolling, and some JavaScript to create arrows.",
    "languages" : "HTML/CSS, Javascript, Python, React.js",
    "code" : "https://github.com/Matthew-Simanonis/portfolio",
    "improvements" : "In the future I hope to add more projects, with live demos, as some are not on the web yet. The site could probably use a bit of a design cleanup as well."
   }
 ]
}
